package google.usefullquestion;啊据我了解Google用PageRank算法啦 可以排出link的先后啦
小哥竟然tm听上去很开心！！！
我真是给自己跪了OrzOrzOrz
扯了扯PageRank算法 提到了时间戳来判断文章修改时间.1point3acres缃
顺便和小哥聊了聊之前自己就是做这个的 简历里有写.鏈枃鍘熷垱鑷1point3acres璁哄潧
然后又扯了半天blablabla
小哥说如果转发的人恶意篡改你的修改时间怎么办
我：............不知道
小哥表示没事我就随便问问我就是做这个的而已（web search）
然后他说如果两篇文章很相近Google怎么判断？
答之最长公共子序列 DP
注意此时已经20多分钟了还没让我写代码！！！
他让我给他讲讲
我说我直接给你写代码吧
他表示好呀好呀好呀 鏉ユ簮涓€浜.涓夊垎鍦拌鍧. 
然后我就............自嗨地敲了
然后给他讲了讲流程 可以空间优化等等
设计了test case
小哥又问如果网页很大怎么破
我说那就上并行啊！（哈哈我的老本行又说了一堆）
最后超时很长了我写了个O(M*N/64)然后又删了说不对
小哥直接说就这样吧 你给我讲讲为什么不对. 1point 3acres 璁哄潧
我就直接写O(N)=c*N（其实应该不是等号 大于还是小于来着我忘了...）